
years = [2018, 2019, 2020, 2021, 2022, 2023]

"""
Диапазоны строк для парсинга бухгалтерских отчетов о движении товаров.
Анализируем движение товаров за последние 5 лет.
"""

range_2018 = [(35, 40), (43, 182), (184, 185), (187, 424), (426, 427)]
range_2019 = [(53, 60), (63, 208), (211, 212), (214, 215), (217, 506), (508, 509)]
range_2020 = [(41, 48), (51, 162), (164, 441)]
range_2021 = [(41, 46), (49, 180), (182, 543)]
range_2022 = [(29, 36), (39, 148), (151, 152), (154, 521)]
range_2023 = [(29, 34), (37, 100), (102, 309)]

ranges = {
    years[0]: range_2018,
    years[1]: range_2019,
    years[2]: range_2020,
    years[3]: range_2021,
    years[4]: range_2022,
    years[5]: range_2023
}